Tasks/Задача_РКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>Задача_РКД</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Задачи_ПКД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

InformationRegisters/ТаймингЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТаймингЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДатыКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БезГабаритногоЧертежа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЗамера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейРКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Код_в_PDM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаДоработки_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаДоработки_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокМонтажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроектирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыЗадачКонструирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЗадачКонструирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоработкаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольДизайнера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеМенеджером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеФиндиректором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Редакция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рекламация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РКД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезИзмененияКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСВнешнегоДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботеКонструктора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДизайнерскийКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаДизайнером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеПроверкиВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаДизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеВнешнегоСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеПодтвержденияВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеФиндиректором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриостановкаКонструктором</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Tasks/Задача_РКД/Forms/ФормаЗадачи/Ext/Form/Module.bsl
&НаКлиенте
Перем ИзмененыСлужебныеНастройки;

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		
		стДанные = РегистрыСведений.ТаймингЗадач.ПолучитьСостояниеЗадачи(Объект.Ссылка);
		ТекущиеСостояние 		= стДанные.Состояние;
		ТекущиеСостояниеСтрокой = стДанные.Представление;
		КрайРКД					= ПолучитьКрайРКД();
		
	КонецЕсли;
	
	Если Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором 
		ИЛИ Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.Разработка Тогда
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Истина;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Ложь;	
		
	ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором Тогда
		
		Элементы.ГруппаКнопкаКонструктора.Видимость 		= Ложь;	
		Элементы.ГруппаКнопкиВедущегоКонструктора.Видимость = Истина;	
		
	КонецЕсли;
	
	Состояние = ТекущиеСостояние;

КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ИзмененыСлужебныеНастройки = Ложь;
	Элементы.ГруппаИстория.Видимость = Ложь;
	ВидимостьКнопок();
	
КонецПроцедуры

Функция ПолучитьКрайРКД()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплекта.КрайРКД КАК КрайРКД
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	ДатыКомплекта.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", Объект.ИзделиеКомплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КрайРКД; 
	КонецЦикла; 
	
	Возврат Дата(1, 1, 1);
	
КонецФункции // ПолучитьКрайПКД()

#Область Команды

#Область  КомандыКонструктора

&НаКлиенте
Процедура НачатьВыполнение(Команда)
	
	КонструкторОбъекта = КонтрольСоответствияКонструкторов(Объект.ИзделиеКомплект);
	
	Если КонструкторОбъекта = Объект.Исполнитель Тогда
	
		//стВозврата = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(Объект.ОбъектТЗ, "Конструктор");
		//Если НЕ ПустаяСтрока(стВозврата.ОписаниеОшибки) Тогда
		//	ПоказатьПредупреждение(,стВозврата.ОписаниеОшибки);	
		//КонецЕсли;
	
	Иначе	
		
		ПоказатьПредупреждение(, "Конструктор в объекте " + КонструкторОбъекта + " не соответствует исполнителю");
		Возврат;
		
	КонецЕсли;
	
	стДанные = ДействияНаСервере("НачатьВыполнение", Объект.Ссылка, Объект.Исполнитель);
	ТекущиеСостояние 		= стДанные.Состояние;
	ТекущиеСостояниеСтрокой = стДанные.Представление;
	ВидимостьКнопок();
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыполнение(Команда)
	
	Если Модифицированность Тогда
		
		ПоказатьПредупреждение(, "Не обходимо сохранить задачу.");
		Возврат;
		
	КонецЕсли;
	
	стДанные = ДействияНаСервере("ЗавершениеРаботы", Объект.Ссылка, Объект.ИзделиеКомплект);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Приостановить(Команда)
	
	стДанные = ДействияНаСервере("Приостановить", Объект.Ссылка, Объект.Исполнитель);
	ТекущиеСостояние 		= стДанные.Состояние;
	ТекущиеСостояниеСтрокой = стДанные.Представление;
	ВидимостьКнопок();
	
КонецПроцедуры
#КонецОбласти

#Область КомандыВедущегоКонструктороа

&НаКлиенте
Процедура ДоработкаВедущийКонструктор(Команда)
	
	стДанные = ДействияНаСервере("ДоработкаВедущийКонструктор", Объект.Ссылка, Объект.Исполнитель);
	Закрыть();
	
КонецПроцедуры 


&НаКлиенте
Процедура Завершение(Команда)

	стДанные = ДействияНаСервере("Завершение", Объект.Ссылка, Объект.Исполнитель);
	Закрыть();
	
КонецПроцедуры


#КонецОбласти

&НаКлиенте
Процедура История(Команда)
	
	История = ДействияНаСервере("История", Объект.Ссылка);
	Элементы.ГруппаИстория.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьИсторию(Команда)
	Элементы.ГруппаИстория.Видимость = Ложь;
КонецПроцедуры

#КонецОбласти  

&НаСервереБезКонтекста
Функция КонтрольСоответствияКонструкторов(ОбъектТЗ)

	Возврат омКонструктор.ПолучитьДанныеОбъекта(ОбъектТЗ).КонструкторПользователь;		

КонецФункции // КонтрольСоответствияКонструкторов()

&НаСервереБезКонтекста
Функция ДействияНаСервере(Действие, Задача, Параметр = Неопределено)
	
	МенеджерРегистра 	= РегистрыСведений.ТаймингЗадач;

	Если Действие = "История" Тогда
		Возврат МенеджерРегистра.ПолучитьИсториюЗадачи(Задача);
	КонецЕсли;
	
	стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(,,Перечисления.СтатусыЗадач.РКД);
	
	Если Действие = "НачатьВыполнение" Тогда 
		стДанные.Состояние 	= Перечисления.СостоянияЗадач.ВРаботеКонструктора;
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
	ИначеЕсли Действие = "Приостановить" Тогда
		стДанные.Состояние 	= Перечисления.СостоянияЗадач.ПриостановкаКонструктором;
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
	ИначеЕсли Действие = "ЗавершениеРаботы" Тогда
		
		ВедущийКонструктор = омСотрудники.СотрудникиОбъекта(Параметр).ВедущийКонструктор;
		
		ОбъектЗадача 				= Задача.ПолучитьОбъект();
		ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ИзделиеКомплект)  + ".РКД.Проверка";
		ОбъектЗадача.Дата			= ТекущаяДата();
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором;
		ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.РКД;
		ОбъектЗадача.Исполнитель 	= ВедущийКонструктор;
		ОбъектЗадача.Записать();
		
		стДанные.Состояние 		= Перечисления.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором;
		стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
		стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
		
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
		
	ИначеЕсли Действие = "ДоработкаВедущийКонструктор" Тогда
		
		Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);
		
		ОбъектЗадача 				= Задача.ПолучитьОбъект(); 
		ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ИзделиеКомплект)  + ".РКД.Доработка";
		ОбъектЗадача.Дата			= ТекущаяДата();
		ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.РКД;
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ДоработкаКонструктором;
		ОбъектЗадача.Исполнитель 	= Конструктор;
		
		ОбъектЗадача.Записать();
		
		стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
		стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
		стДанные.Состояние 		= Перечисления.СостоянияЗадач.ОжиданиеКонструктором;
		
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные);
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
		
	ИначеЕсли Действие = "Завершение" Тогда
		
		
		ОбъектЗадача 				= Задача.ПолучитьОбъект();
		ОбъектЗадача.Наименование	= Строка(ОбъектЗадача.ИзделиеКомплект)  + ".РКД.Завершена";
		ОбъектЗадача.Дата			= ТекущаяДата();
		ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.РКД;
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.Завершение;
		ОбъектЗадача.Выполнена      = Истина;
		
		ОбъектЗадача.Записать(); 
		
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
		
	КонецЕсли;
	
	
	Возврат РегистрыСведений.ТаймингЗадач.ПолучитьСостояниеЗадачи(Задача);
	
КонецФункции // ДействияНаСервере()  

&НаКлиенте
Процедура ВидимостьКнопок()
	
	Если ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ЗавершенаКонструктором") Тогда
		
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Ложь;
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		
	ИначеЕсли ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ВРаботеКонструктора") Тогда
		
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Ложь;
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Истина;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Истина;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Истина;
		
	ИначеЕсли ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ОжиданиеКонструктором") Тогда
		
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Истина;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		
	ИначеЕсли ТекущиеСостояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.ПриостановкаКонструктором") Тогда
		
		Элементы.КнопкаНачатьВыполнениеКонструктор.Видимость 		= Истина;
		Элементы.КнопкаЗавершитьВыполнениеКонструктор.Видимость 	= Ложь;
		Элементы.КнопкаПриостановитьКонструктор.Видимость 			= Ложь;
		Элементы.КнопкаОтложитьКонструктор.Видимость 				= Ложь;
		
	КонецЕсли;
	
	
КонецПроцедуры // ВидимостьКнопок()

&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	ИзмененыСлужебныеНастройки = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если ИзмененыСлужебныеНастройки Тогда
	
		ИзменитьСостоянияНаСервере(Объект.Ссылка, Объект.ОбъектТЗ, Объект.ТипЗадачи, Объект.СтатусЗадачи, Состояние);		
	
	КонецЕсли;
КонецПроцедуры  

&НаСервереБезКонтекста
Процедура ИзменитьСостоянияНаСервере(Задача, ОбъектТЗ, ТипЗадачи, СтатусЗадачи, Состояние)
	
	Исполнитель = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадачСрезПоследних.Исполнитель КАК Исполнитель
		|ИЗ
		|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача = &Задача) КАК ТаймингЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Исполнитель = Выборка.Исполнитель			
	КонецЦикла;
	
	МЗ = РегистрыСведений.ТаймингЗадач.СоздатьМенеджерЗаписи();
	МЗ.Период =  ТекущаяДата();
	МЗ.Автор = ПараметрыСеанса.ТекущийПользователь;
	МЗ.Задача = Задача;
	МЗ.Исполнитель = Исполнитель;
	МЗ.Состояние = Состояние;
	МЗ.Статус = СтатусЗадачи;
	МЗ.ТипЗадачи = ТипЗадачи;
	
	МЗ.Записать();
	
	омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
	
КонецПроцедуры // ИзменитьСостоянияНаСервере()
